/**It is important that this is present in every API.
 * @access For server side only.
 */
export const backendURL = { baseURL: process.env.API_URL };
export const ENVIROMENT = process.env.NODE_ENV;
export const IMAGE_URL = process.env.API_URL ?? "issues with env";
export const POSTER_URL =
  ENVIROMENT === "production"
    ? process.env.S3_IMAGE_BASE_URL
    : IMAGE_URL + "/api/movies";

export const AVATAR_URL =
  ENVIROMENT === "production"
    ? process.env.S3_IMAGE_BASE_URL
    : IMAGE_URL + "/api/avatars";

export const movieComponents = {
  specification:
    "Це складова фільму, яка описує не конкретну річ, а скоріше як концепцію чи абстрактний інструмент, який дає головній історії/сюжету змогу існувати чи працювати. Воно може описати все і нічого водночас. Це не про душу фільму чи скелет, а скоріше про те що існує між всіма цими деталями. Ця категорія відображає глибші ідеї та структурні особливості стрічки. Важливо! Через то що існує нескінченна безліч фільмів специфікація може (чи має) бути для кожного своя. Наприклад зомбі є у багатьох кіно але як вони представляються це вже інше питання і про це буде говорити процент підходящості.",
  keyword:
    "Це про конкретні деталі фільму які ярко виділяються і що важливо – по ним найчастіше згадується фільм. Вони можуть вмотивувати передивитись кіно. Цими деталями може бути будь що: персонажі, музика, дії тощо. Процент підходящості буде вказувати на час, який приділений цим деталям, якість, наприклад музика може бути чудовою але не змушує додати себе в плейліст. Зрівняння між схожими деталями з інших кіно і хотя так не варто цілому робити але коли хтось ставе вищу планку то ти не можеш її заперечувати і на автоматі будеш зрівнювати гру цього персонажа/актора (e.g Джокер) з грою інших і т.д.",
  actionTime:
    "Вказує на часові або історично відомі події в яких відбувається головний сюжет фільму. Тут є тільки самі основні, тому що неможливо покрити всі існуючі. Якщо в фільмі показано багато локацій і невідомого часу, наприклад планету прибульців які більш розвинуті то в такому випадку просто вказати час в якому живуть головні персонажі. Це може бути і реальний час і час який вигаданий для фільму.",
  genre:
    "Це жанр фільму який відображає його основну ідею, або те як він виглядає. Це може бути дуже важливо для людей які шукають фільм для перегляду. Це може бути як дуже вузький жанр так і широкий. Наприклад фільм про війну може бути і драмою і бойовиком, але він не може бути комедією. Це може бути важливо для людей які шукають фільм для перегляду.",
  subgenre:
    "Це піджанр фільму який відображає його додаткову ідею, або те як він виглядає. Це може бути дуже важливо для людей які шукають фільм для перегляду. Це може бути як дуже вузький жанр так і широкий. Наприклад фільм про війну може бути і драмою і бойовиком, але він не може бути комедією. Це може бути важливо для людей які шукають фільм для перегляду.",
};
