{
  "HomePage": {
    "title": "Title Seeker",
    "subTitle": "Flexibility, speed, and simplicity will allow you to find the desired title at any time and place!",
    "navigation": {
      "movies": "Movies",
      "tvseries": "TV Series",
      "anime": "Anime",
      "games": "Games"
    },
    "description": "There are times when you want to watch a good movie, especially when you are not in the mood or when you have already watched everything you wanted, but instead of watching it, you spend a lot of time searching for the desired movie in hundreds of lists and compilations, and as a result - you do not watch anything.",
    "solution": "This platform was created to solve this problem!",
    "keyFeatures": {
      "title": "Key features:",
      "keys": {
        "first": "Movie search with many filters that will help narrow down the list as much as possible.",
        "second": "The ability to rate movies and form your own movie lists, have statistics and much more (only for registered users).",
        "third": "The mobile version of the site will allow you to do almost everything that is available on the desktop with maximum adaptability and speed."
      }
    },
    "addMovie": "Add Movie",
    "quicklyAddMovie": "Quickly add Movie",
    "topActorsCarousel": "Top Actors by movies count"
  },
  "MenuItems": {
    "content": "Content",
    "user": "User",
    "admin": "Admin",
    "profile": {
      "key": "profile",
      "label": "Profile"
    },
    "dashboard": {
      "key": "dashboard",
      "label": "Dashboard"
    },
    "myLists": {
      "key": "my-lists",
      "label": "My lists"
    },
    "newMoviesToAdd": {
      "key": "new-movies-to-add",
      "label": "New Movies to add"
    },
    "allUsers": {
      "key": "all-users",
      "label": "All users"
    },
    "settings": {
      "key": "settings",
      "label": "Settings"
    },
    "logout": "Log out",
    "notFound": "No item found.",
    "addNew": "Add?",
    "search": "Search..."
  },
  "Search": {
    "search": "Search...",
    "type": "Type to search...",
    "super": "Super search",
    "recent": "Recent searches",
    "suggestions": "Suggestions"
  },

  "SuperSearch": {
    "title": "Advanced title search",
    "emptyState": "Please select at least one filter to search for movies",
    "enhance": "Enhance Search",
    "exactMatch": "Exact match",
    "clear": "Clear all filters",
    "notFound": "No movies found with selected filters"
  },

  "Filters": {
    "genre": {
      "name": "Genres",
      "description": "This is the genre of a film that reflects its main idea, or what it looks like. This can be very important for people looking for a film to watch. It can be either a very narrow genre or a broad one. For example, a war film can be both a drama and an action film, but it cannot be a comedy. This can be important for people looking for a film to watch."
    },
    "subgenre": {
      "name": "Subgenres",
      "description": "This is a subgenre of a film that reflects its additional idea, or what it looks like. This can be very important for people looking for a film to watch. It can be either a very narrow genre or a broad one. For example, a war film can be both a drama and an action film, but it cannot be a comedy. This can be important for people looking for a film to watch."
    },
    "specification": {
      "name": "Specifications",
      "description": "This is a component of a film that does not describe a specific thing, but rather a concept or abstract tool that allows the main story/plot to exist or work. It can describe everything and nothing at the same time. It is not about the soul of the film or the skeleton, but rather about what exists between all these details. This category reflects the deeper ideas and structural features of the film. Important! Because there are an infinite number of films, the specification can (or should) be different for each. For example, zombies are in many films, but how they are presented is another question and the percentage of suitability will tell about this."
    },
    "keyword": {
      "name": "Keywords",
      "description": "It's about specific details of the film that stand out and, importantly, are the ones that most often remind you of the film. They can motivate you to watch the film again. These details can be anything: characters, music, action, etc. The percentage of suitability will indicate the time spent on these details, the quality, for example, the music can be great but does not force you to add it to the playlist. Comparisons between similar details from other films and although this is generally not worth doing, but when someone sets a higher bar, you cannot deny it and you will automatically compare the performance of this character/actor (e.g. Joker) with the performance of others, etc."
    },
    "action_time": {
      "name": "Action Times",
      "description": "Indicates the time or historically known events in which the main plot of the film takes place. Here are only the most basic, because it is impossible to cover all existing ones. If the film shows many locations and an unknown time, for example, a planet of aliens who are more developed, then in this case simply indicate the time in which the main characters live. This can be both real time and time that is invented for the film."
    },
    "actor": "Actors",
    "director": "Director",
    "directorPlural": "Directors",
    "genreNotFound": "Genre not found",
    "subgenreNotFound": "No subgenres found OR select a genre first.",
    "filterNotFound": "Filter not found",
    "peopleNotFound": "No person found",
    "addNewItem": "Add new filter"
  },

  "MovieParts": {
    "related": "Related Movies",
    "similar": "Similar Movies",
    "boxOffice": {
      "budget": "The total budget of the picture, how much was spent.",
      "domesticGross": "How much the movie earned in the country where it was filmed. Also, only the studio producer can be considered domestic (a movie can be made in many countries).",
      "worldwideGross": "How much the movie has earned for all time (or until now) around the world."
    }
  },

  "Rating": {
    "basic": "Basic",
    "acting": {
      "name": "Acting",
      "description": "The acting is evaluated, their ability to convey emotions well, reveal the character's character, how they fit into the universe of the film and their interaction with other actors. It is also evaluated how alive the characters came out (whom you believe 100%). It also happens that the character is just an ordinary person, but the actor played so well that you can't imagine anyone else in this role (even if it's the only such role in the actor's career). Note: you can evaluate both the performance of one actor and all of them. The main thing is that the acting should be of high quality."
    },
    "plot_storyline": {
      "name": "Plot/Storyline",
      "description": "The plot, character storylines, the revelation of issues and conflicts, the progression of everything (including the world of the film itself) are evaluated. How creatively they approached various clichés. A high-quality ending and an answer to the questions raised or a reasonable continuation (i.e. not just for the sake of money)."
    },
    "script_dialogue": {
      "name": "Script/Dialogue",
      "description": "The quality of the dialogues is assessed, how well they reveal the characters and the surrounding world. Is there a strength of subtext and intelligent understatement, where everything is not chewed over for you like a child. Where there are no 10-minute dialogues for nothing. Note: you should not compare everything to 'Tarantino' dialogues, which are of course the pinnacle of art, but most films simply do not meet this criterion."
    },
    "music": {
      "name": "Music",
      "description": "It is evaluated how well the music fits the context of the film, sets the right mood and describes the events. It can even immerse you in the film more than any other aspect. Music can be memorable and then give you an incentive to watch the film again. You should not give a bad rating if there is little or no music or it is quiet or absent altogether. Epic music or its absence should work in context."
    },
    "enjoyment": {
      "name": "Enjoyment",
      "description": "The pleasure that the movie brought is evaluated. Here you don't need to think about other evaluation criteria, about reviews or other people's opinions. The most important thing is only subjective impressions. For example, a movie can be stupid, but if it gave a little good mood, then it should be evaluated relatively."
    },
    "production_design": {
      "name": "Production Design",
      "description": "The quality of clothing, costumes, scenery, props, etc. (not graphics) is evaluated. How well these things convey a certain period of time. For example, if in Ancient Greece instead of beautiful scenery, modern architecture is shown, which is simply similar, then this is poor quality work."
    },
    "visual_effects": {
      "name": "Visual Effects",
      "description": "The quality of the graphics and various effects is evaluated in relation to the given film. That is, one should not compare the graphics of the 80s and the 2020s. The graphics should be harmoniously integrated into the overall picture of the film and should be appropriate, and not just graphics for the sake of graphics."
    },
    "scare_factor": {
      "name": "Scare Factor",
      "description": "It is assessed how much the film was able to evoke a feeling of fear or creepiness when the events of the film did not let go for some time. Note: simple screamers that scare are not real fear, but simply a reaction to a sudden/sharp action accompanied by a loud sound. This technique should be auxiliary, not the main or frequently used."
    },
    "humor": {
      "name": "Humor",
      "description": "A film that has a comedic element from beginning to end, where funny acting is an element of the world, not “feigning for the sake of feigning.” The worldbuilding has a funny or caricature element. The characters exist with something that seems funny and stupid to us, but for them it is part of life. The most important thing is that the funny/stupid element remains until the end of the film, and it is not eliminated. For example, Mr. Bean or the Pink Panther, who save the world in bizarre ways. That is, they did not become “normal” by the end of the film, but continued their “natural” life further. It is evaluated how much logic and comedy work together. And how funny the film was overall. Examples: Idiocracy, Don't Threaten South Central..., Jay and Silent Bob... Note: films like 9 Yards do not fit this criterion, because the comedy there is that an ordinary person gets involved in crime and starts behaving like a fool, but then gets used to it and therefore everything smoothly becomes normal for him (and for the viewer)."
    },
    "animation_cartoon": {
      "name": "Animation/Cartoon",
      "description": "These are popular full-length cartoons like Shrek or Treasure Island. The quality of the picture, animation, characters, etc. is evaluated. In the 'Action' criterion, the voice, emotions and how the voice actor naturally conveyed the character's character are evaluated."
    },
    "ratingType": {
      "name": "Rating type",
      "my": "My Rating",
      "overall": "Overall Rating",
      "owner": "Owner Rating"
    }
  },
  "Form": {
    "submit": "Submit",
    "clear": "Clear form",
    "prevStep": "Previous step",
    "nextStep": "Next step",
    "skip": "Skip",
    "menuSelect": "Select",
    "stepper": {
      "titleRate": {
        "name": "Title/Rate",
        "titleEn": "Title (en)",
        "titleUk": "Title (uk)",
        "key": "Key",
        "poster": "Poster"
      },
      "sharedUniverse": {
        "name": "Shared Universe",
        "order": "Order",
        "addNewSU": "Add new universe"
      },
      "relatedMovie": {
        "name": "Related Movie",
        "base": "Base movie",
        "collectionOrder": "Collection order",
        "relationType": "Relation type",
        "notFount": "If no movie in the list - Skip"
      },
      "info": {
        "name": "Info",
        "descriptionEn": "Description (en)",
        "descriptionUk": "Description (uk)",
        "date": "Release date",
        "locationEn": "Location (en)",
        "locationUk": "Location (uk)",
        "duration": "Duration (in minutes)",
        "budget": "Budget ($)",
        "domesticGross": "Domestic gross ($)",
        "worldwideGross": "Worldwide gross ($)"
      },
      "people": {
        "name": "People",
        "actors": "Actors",
        "orderInfo": "Order of actors is important. The first actor will be the main, and so on.",
        "directors": "Directors",
        "selectActors": "Select the actors",
        "selectDirectors": "Select the directors",
        "addActor": "Add new Actor",
        "addDirector": "Add new Director",
        "addChar": "Add new Character"
      },
      "genres": {
        "name": "Genres",
        "subgenres": "Subgenres",
        "addNewGenre": "Add new Genre",
        "addNewSubgenre": "Add new Subgenre"
      },
      "filters": {
        "name": "Filters",
        "addNewSpec": "Add new specification",
        "addNewKeyword": "Add new keyword",
        "addNewActionTime": "Add new action time"
      },
      "summary": {
        "name": "Summary"
      }
    },
    "itemFields": {
      "key": "Key",
      "nameEn": "Name (en)",
      "nameUk": "Name (uk)",
      "descriptionEn": "Description (en)",
      "descriptionUk": "Description (en)"
    },
    "personFields": {
      "key": "Key",
      "firstNameEn": "First name (en)",
      "lastNameEn": "Last name (en)",
      "firstNameUk": "FIrst name (uk)",
      "lastNameUk": "Last name (uk)",
      "born": "Born",
      "died": "Died",
      "bornInEn": "Born in (en)",
      "bornInUk": "Born in (uk)",
      "avatar": "Avatar"
    },
    "quickMovie": {
      "title": "Quickly add new Movie",
      "movieTitleEn": "Title (en)",
      "key": "Key"
    }
  },

  "Charts": {
    "genresTitle": "Top 8 most popular movie genres",
    "genresSubtext": "Shows how many movies with these genres you have rated.",
    "topMoviesTitle": "My Top 3 Movies",
    "topMoviesSubtext": "Shows your most rated movies.",
    "timeChart": "Latest movie ratings",
    "timeChartSubtext": "Shows the dynamics of movie ratings."
  },
  "User": {
    "joined": "Joined",
    "ratedCount": "Rated movies",
    "totalActors": "Total actors",
    "lastRatingDate": "Date of last rating"
  },

  "Dashboard": {
    "title": "Dashboard",
    "subTitle": "Welcome to your dashboard!"
  },

  "QuickMovie": {
    "title": "New Movies to add",
    "subTitle": "List of movies that need to be added to the database.",
    "empty": "No movies to add"
  },

  "AllUsers": {
    "title": "All Users"
  },

  "Settings": {
    "title": "Settings",
    "subTitle": "Manage your account settings here",
    "language": "Language",
    "langSubtext": "Here you can save the language that will be used by default. Changing the language elsewhere changes it only for the current session.",
    "delete": "Delete Profile",
    "deleteSubtext": "If you delete your profile, you will lose all rated titles.",
    "deleteWarning": "Are you sure you want to delete your profile? This action cannot be undone."
  },

  "notImplemented": "not implemented yet",
  "Other": {
    "showValues": "Show values",
    "total": "Total",
    "saveRating": "Save rating",
    "lastSeenTitles": "Last Seen Titles",

    "paginationPrev": "Previous",
    "paginationNext": "Next",

    "sorting": {
      "sortOrder": "Sort Order",
      "desc": "Descending",
      "asc": "Ascending",
      "sortBy": "Sort by",
      "ratedAt": "Rated Date",
      "rating": "Rating",
      "ratingsCount": "Ratings count",
      "releaseDate": "Release date",
      "random": "Random"
    }
  }
}
